[
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/china-imported-1-12-billion-tonnes-of-iron-ore",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "December 2020",
    "price_usd": 75.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "in Smirk remarked in a note that current levels were still five years high, implying that it will take a long time before it involves a constricted market. According to him, iron ore prices may reach USD 75 per tonne by the end of 2022 since China's strict steel output curbs to reduce emissions are expected to continue. Beijing has long been critical of Rio Tinto, BHP, and Vale, who control the gl",
    "scraped_date": "2025-11-16 18:51:04"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-deteriorating-industrial-prospects-are-yet-to-reflect-on-the-copper-and-iron-ore-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "October 2021",
    "price_usd": 146.5,
    "price_range_min": null,
    "price_range_max": null,
    "context": "cent of worldwide seaborne quantities. On April 29, the spot price of benchmark 62 percent iron ore for delivery to north China, as determined by commodities price reporting agency Argus, finished at USD 146.50 a tonne, admittedly before the weekend release of the PMI data. It has decreased 8.5 percent since reaching a high of USD 160.30 per tonne on March 8 in the aftermath of Russia's invasion o",
    "scraped_date": "2025-11-16 18:51:07"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-deteriorating-industrial-prospects-are-yet-to-reflect-on-the-copper-and-iron-ore-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "October 2021",
    "price_usd": 160.3,
    "price_range_min": null,
    "price_range_max": null,
    "context": "as determined by commodities price reporting agency Argus, finished at USD 146.50 a tonne, admittedly before the weekend release of the PMI data. It has decreased 8.5 percent since reaching a high of USD 160.30 per tonne on March 8 in the aftermath of Russia's invasion of Ukraine, which had been the fourth-largest shipper of iron ore before the war. However, iron ore remains much above USD 105.95",
    "scraped_date": "2025-11-16 18:51:07"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-deteriorating-industrial-prospects-are-yet-to-reflect-on-the-copper-and-iron-ore-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "October 2021",
    "price_usd": 105.95,
    "price_range_min": null,
    "price_range_max": null,
    "context": "a high of USD 160.30 per tonne on March 8 in the aftermath of Russia's invasion of Ukraine, which had been the fourth-largest shipper of iron ore before the war. However, iron ore remains much above USD 105.95 per tonne, which was the price in October 2021, when China's PMI last fell below 50. It's also higher than the USD 83.15 per tonne seen in February 2020, when China's PMI plummeted as the f",
    "scraped_date": "2025-11-16 18:51:07"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-deteriorating-industrial-prospects-are-yet-to-reflect-on-the-copper-and-iron-ore-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "February 2020",
    "price_usd": 83.15,
    "price_range_min": null,
    "price_range_max": null,
    "context": "gest shipper of iron ore before the war. However, iron ore remains much above USD 105.95 per tonne, which was the price in October 2021, when China's PMI last fell below 50. It's also higher than the USD 83.15 per tonne seen in February 2020, when China's PMI plummeted as the first wave of the coronavirus outbreak devastated the country's economy. The iron ore price was USD 84.70 a tonne when Chin",
    "scraped_date": "2025-11-16 18:51:07"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-deteriorating-industrial-prospects-are-yet-to-reflect-on-the-copper-and-iron-ore-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "February 2019",
    "price_usd": 84.7,
    "price_range_min": null,
    "price_range_max": null,
    "context": "It's also higher than the USD 83.15 per tonne seen in February 2020, when China's PMI plummeted as the first wave of the coronavirus outbreak devastated the country's economy. The iron ore price was USD 84.70 a tonne when China's PMI was below 50 in February 2019, and USD 48.65 when the PMI was at 49 points in February 2016. Aside from the relative health of China's industrial sector, other facto",
    "scraped_date": "2025-11-16 18:51:07"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-deteriorating-industrial-prospects-are-yet-to-reflect-on-the-copper-and-iron-ore-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "February 2019",
    "price_usd": 48.65,
    "price_range_min": null,
    "price_range_max": null,
    "context": "when China's PMI plummeted as the first wave of the coronavirus outbreak devastated the country's economy. The iron ore price was USD 84.70 a tonne when China's PMI was below 50 in February 2019, and USD 48.65 when the PMI was at 49 points in February 2016. Aside from the relative health of China's industrial sector, other factors determine iron ore prices, although some of them, such as infrastru",
    "scraped_date": "2025-11-16 18:51:07"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-impetus-to-lower-the-mortgage-interest-rate",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2019",
    "price_usd": 135.9,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ore prices and multiple reasons point to a further advance. On May 20, spot 62 percent iron ore for delivery to north China, as measured by commodity price reporting agency Argus, rose 5.7 percent to USD 135.90 a tonne, the biggest closing since May 6. Domestic iron ore prospects on the Dalian Commodity Exchange were also increased on May 20, increasing 3.4 percent to 827 yuan (USD 123.62) per ton",
    "scraped_date": "2025-11-16 18:51:09"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/chinas-impetus-to-lower-the-mortgage-interest-rate",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2019",
    "price_usd": 123.62,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ose 5.7 percent to USD 135.90 a tonne, the biggest closing since May 6. Domestic iron ore prospects on the Dalian Commodity Exchange were also increased on May 20, increasing 3.4 percent to 827 yuan (USD 123.62) per tonne. In the monthly fix on May 20, China cut the five-year loan prime rate by 15 basis points to 4.45 percent, the largest drop since the exchange rate mechanism was restructured in",
    "scraped_date": "2025-11-16 18:51:09"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/elevated-iron-ore-prices-led-to-rio-tinto-record-profit",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2021",
    "price_usd": 21.38,
    "price_range_min": null,
    "price_range_max": null,
    "context": "development sector. On the good side, it ended a long-running dispute over a sizeable copper-gold mining project in Mongolia. On Wednesday, the Anglo-Australian miner reported underlying earnings of USD 21.38 billion for the year ended December 31, increasing 72 percent from the previous year. According to Visible Alpha, analysts predicted underlying revenues of USD 21.63 billion. Rio Tinto's chi",
    "scraped_date": "2025-11-16 18:51:20"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/elevated-iron-ore-prices-led-to-rio-tinto-record-profit",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2021",
    "price_usd": 21.63,
    "price_range_min": null,
    "price_range_max": null,
    "context": "r reported underlying earnings of USD 21.38 billion for the year ended December 31, increasing 72 percent from the previous year. According to Visible Alpha, analysts predicted underlying revenues of USD 21.63 billion. Rio Tinto's chief executive, Jakob Stausholm, stated that after the results were published, their financial sheet was the highest in at least 15 years. Rio Tinto issued a final spec",
    "scraped_date": "2025-11-16 18:51:20"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/global-urge-for-using-green-steel-may-harm-australia-iron-ore-exports",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 150.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "Report Says, that the Global Urge for Using Green Steel May Harm Australia’s USD 150 billion Iron Ore Exports, If Miners Do Not Adjust to the Change Mar 15, 2022 According to a Bloomberg New Energy Finance analysis, BHP, Fortescue, and other big Australian iron ore miners may",
    "scraped_date": "2025-11-16 18:51:28"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/global-urge-for-using-green-steel-may-harm-australia-iron-ore-exports",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 278.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "many options for weaning one of the world's largest greenhouse-gas generating sectors off fossil fuels. As per the research, achieving net-zero emissions would need an additional investment of up to USD 278 billion (USD A388 billion), a move to more recycled steel, and a range of carbon pricing. The transition to electric arc furnaces, which would ideally be fueled by renewable energy, would typi",
    "scraped_date": "2025-11-16 18:51:28"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/global-urge-for-using-green-steel-may-harm-australia-iron-ore-exports",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2022",
    "price_usd": 150.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "on technology, or it could force iron ore production and perhaps green steelmaking capacity closer to higher-grade ore producers. Iron ore is Australia's most valuable single export, valued at almost USD 150 billion in the fiscal year ending in June. The government predicted earlier this year that dropping ore prices would bring in around USD 113 billion by 2022-23. The steel sector, which current",
    "scraped_date": "2025-11-16 18:51:28"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/global-urge-for-using-green-steel-may-harm-australia-iron-ore-exports",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2022",
    "price_usd": 113.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "Australia's most valuable single export, valued at almost USD 150 billion in the fiscal year ending in June. The government predicted earlier this year that dropping ore prices would bring in around USD 113 billion by 2022-23. The steel sector, which currently accounts for around 7 percent of world emissions, will be in the vanguard of efforts to reduce carbon pollution if disastrous climate chan",
    "scraped_date": "2025-11-16 18:51:28"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-may-rise-by-4-6-percent",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 115.55,
    "price_range_min": null,
    "price_range_max": null,
    "context": "due to a significant shift in the COVID-19 containment policy in China. The iron ore most traded in May on China's Dalian Commodity Exchange ceased morning trade lower by 0.3 percent at 806.50 yuan (USD 115.55) a tonne. On Friday, Dalian iron ore rose to 823 yuan a tonne, the highest since June 15, as China eased the COVID-19 restrictions in hopes of reviving demand. The benchmark January contrac",
    "scraped_date": "2025-11-16 18:51:32"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-may-rise-by-4-6-percent",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 109.55,
    "price_range_min": null,
    "price_range_max": null,
    "context": "e, the highest since June 15, as China eased the COVID-19 restrictions in hopes of reviving demand. The benchmark January contract for the steelmaking ingredient on the Singapore Exchange was down to USD 109.55 a tonne by 1.8 percent as of 0448 GMT. According to Atilla Widnell, Navigate Commodities Managing Director, the futures of iron ore rallied near around USD 111.75/t on Friday, which is just",
    "scraped_date": "2025-11-16 18:51:32"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-may-rise-by-4-6-percent",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 111.75,
    "price_range_min": null,
    "price_range_max": null,
    "context": "n the Singapore Exchange was down to USD 109.55 a tonne by 1.8 percent as of 0448 GMT. According to Atilla Widnell, Navigate Commodities Managing Director, the futures of iron ore rallied near around USD 111.75/t on Friday, which is just another poignant instance of just how much heat and extremely positive sentiment is presently built into the present pricing structure. Currently, iron ore above",
    "scraped_date": "2025-11-16 18:51:32"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-may-rise-by-4-6-percent",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 100.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "USD 111.75/t on Friday, which is just another poignant instance of just how much heat and extremely positive sentiment is presently built into the present pricing structure. Currently, iron ore above USD 100 a tonne looks overvalued; however, the longer prices continue past this level, the higher the chance is of the pricing-floor starting to move higher. As miners embark on seasonal maintenance p",
    "scraped_date": "2025-11-16 18:51:32"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 300.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "low suit, as per a recent study by CRISIL Research. It can also be noted that the expectation of coal trade resumption between China and Australia has already propelled the prices of coking coal past USD 300/ tonne by December-end. But with the Chinese New Year approaching, a boost in volumes of trade between Australia and China is anticipated just above March. But most Chinese imports are still u",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 250.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ates that Australian coal production will probably not notice any sharp gains owing to concerns over the environment; prices of coking coal will likely remain on the higher end this year at about the USD 250- USD 300 mark. From the point of view of steel consumers, growing input costs have provoked integrated and secondary steel players to declare spikes in costs all over segments in the past two",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 300.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "Australian coal production will probably not notice any sharp gains owing to concerns over the environment; prices of coking coal will likely remain on the higher end this year at about the USD 250- USD 300 mark. From the point of view of steel consumers, growing input costs have provoked integrated and secondary steel players to declare spikes in costs all over segments in the past two weeks, by",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2023",
    "price_usd": 250.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "scal. As per expert predictions, at this onset, with the production of coal not likely to witness any sharp gain in Australian coking, coal prices are likely to remain elevated in 2023, almost at the USD 250- USD 300 mark. According to Procurement Resource, the following article covers the price rise of Hot Rolled Steel due to an increase in prices of Coking Coal and Iron Ore. Furthermore, flat st",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2023",
    "price_usd": 300.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "per expert predictions, at this onset, with the production of coal not likely to witness any sharp gain in Australian coking, coal prices are likely to remain elevated in 2023, almost at the USD 250- USD 300 mark. According to Procurement Resource, the following article covers the price rise of Hot Rolled Steel due to an increase in prices of Coking Coal and Iron Ore. Furthermore, flat steel price",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 300.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "of its coking coal requirement from Australia, and the lifting of an unofficial ban in China means the supply chain will change again. This resumption leads to the rise in prices of coking coal past USD 300/ tonne by December-end. Furthermore, a study by CRISIL indicates that Australian coal production will probably not notice any sharp gains owing to concerns over the environment; prices of coki",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2023",
    "price_usd": 250.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ates that Australian coal production will probably not notice any sharp gains owing to concerns over the environment; prices of coking coal will likely remain on the higher end this year at about the USD 250- USD 300 mark. Also, with coking coal, the prices of domestic iron ore rose by 30 percent by the National Mineral Development Corporation (NMDC) significantly since the upliftment of export du",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2023",
    "price_usd": 300.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "Australian coal production will probably not notice any sharp gains owing to concerns over the environment; prices of coking coal will likely remain on the higher end this year at about the USD 250- USD 300 mark. Also, with coking coal, the prices of domestic iron ore rose by 30 percent by the National Mineral Development Corporation (NMDC) significantly since the upliftment of export duty that c",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2023",
    "price_usd": 250.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "uty that came into effect last November. Finally, with the production of coal not likely to witness any sharp gain in Australian coking, coal prices will likely remain elevated in 2023, almost at the USD 250- USD 300 mark.",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hot-rolled-steel-prices-will-rise",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2023",
    "price_usd": 300.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "came into effect last November. Finally, with the production of coal not likely to witness any sharp gain in Australian coking, coal prices will likely remain elevated in 2023, almost at the USD 250- USD 300 mark.",
    "scraped_date": "2025-11-16 18:51:35"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 50.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "HRC Steel Prices in the United States were Increased by USD 50-70 per tonne Due to Increased Demand and Low Iron Ore Prices Dec 21, 2022 On December 13, 2022, the steelmaker declared that all carbon hot-rolled, cold-rolled, and coated pricing would rise by",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 50.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "tonne Due to Increased Demand and Low Iron Ore Prices Dec 21, 2022 On December 13, 2022, the steelmaker declared that all carbon hot-rolled, cold-rolled, and coated pricing would rise by a minimum of USD 50 per short tonne. Cliffs' current hot-rolled steel minimum base price is USD 750 per net tonne. This further price rise results from improved dynamics in the raw materials and distribution marke",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "December 2022",
    "price_usd": 30.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "e of USD 359.72 per gross tonne in November. As per a distributor, instead of the full USD per short tonne that Cleveland cliffs announced, the market could bear an increase in prime scrap pricing of USD 30 per gross tonne (USD 33.60 per short tonne) in December 2022. Cleveland-Cliffs' November price hike, which was noted in today's release, increased the cost of the same category of flat steel by",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "December 2022",
    "price_usd": 33.6,
    "price_range_min": null,
    "price_range_max": null,
    "context": "s tonne in November. As per a distributor, instead of the full USD per short tonne that Cleveland cliffs announced, the market could bear an increase in prime scrap pricing of USD 30 per gross tonne (USD 33.60 per short tonne) in December 2022. Cleveland-Cliffs' November price hike, which was noted in today's release, increased the cost of the same category of flat steel by at least USD 60 per sho",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "December 2022",
    "price_usd": 60.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "gross tonne (USD 33.60 per short tonne) in December 2022. Cleveland-Cliffs' November price hike, which was noted in today's release, increased the cost of the same category of flat steel by at least USD 60 per short tonne on November 28, two weeks and one day prior to this most recent announcement. Other significant steel producers jumped on board, and despite the fact that it may not have given",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 50.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "scrap prices rise once more in January, mini mills will probably come to the same conclusion and blame imports for the increase. Even though the December 13 statement called for a minimum increase of USD 50 per tonne, the hot rolled coil base price of USD 750 per tonne is USD 65 per tonne higher than current market rates. On December 12, the daily steel hot-rolled coil index, fob mill US, was comp",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 65.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "the same conclusion and blame imports for the increase. Even though the December 13 statement called for a minimum increase of USD 50 per tonne, the hot rolled coil base price of USD 750 per tonne is USD 65 per tonne higher than current market rates. On December 12, the daily steel hot-rolled coil index, fob mill US, was computed at USD 34.25 per cwt (5685 per tonne), up 0.74% from December 9 when",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 34.25,
    "price_range_min": null,
    "price_range_max": null,
    "context": "er tonne, the hot rolled coil base price of USD 750 per tonne is USD 65 per tonne higher than current market rates. On December 12, the daily steel hot-rolled coil index, fob mill US, was computed at USD 34.25 per cwt (5685 per tonne), up 0.74% from December 9 when it was USD 34.00 per cwt and 0.29% from the previous week when it was USD 34.15 per cwt. Before the price increase in November, Clevel",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 34.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "er tonne higher than current market rates. On December 12, the daily steel hot-rolled coil index, fob mill US, was computed at USD 34.25 per cwt (5685 per tonne), up 0.74% from December 9 when it was USD 34.00 per cwt and 0.29% from the previous week when it was USD 34.15 per cwt. Before the price increase in November, Cleveland-Cliffs most recently increased the same group of prices by USD 75 per",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 34.15,
    "price_range_min": null,
    "price_range_max": null,
    "context": "daily steel hot-rolled coil index, fob mill US, was computed at USD 34.25 per cwt (5685 per tonne), up 0.74% from December 9 when it was USD 34.00 per cwt and 0.29% from the previous week when it was USD 34.15 per cwt. Before the price increase in November, Cleveland-Cliffs most recently increased the same group of prices by USD 75 per tonne on August 24, but at the time, it did not appear to esta",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 75.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "en it was USD 34.00 per cwt and 0.29% from the previous week when it was USD 34.15 per cwt. Before the price increase in November, Cleveland-Cliffs most recently increased the same group of prices by USD 75 per tonne on August 24, but at the time, it did not appear to establish a new price floor or reverse months-long declines. Market experts are positive about the six months due to steel purchase",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/hrc-steel-prices-in-the-united-states-were-increased-by-usd-50-70",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 50.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ly the last three months. As per Procurement Resources, the steelmaker announced on December 13, 2022, that the cost of all carbon hot-rolled, cold-rolled, and coated steel would increase by at least USD 50 per short tonne (USD 2.50 per hundredweight). The minimum base price for hot-rolled steel at Cliffs is USD 750 per net tonne. The market's reactions to the company's price increase in November",
    "scraped_date": "2025-11-16 18:51:37"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/indias-steel-products-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 40.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "already heightened the ratio of low-grade iron ore in their manufacturing which in turn is driving up the price of the inexpensive ores and lessening the gap between high and low grades to less than USD 40 per tonne in the current month. This is lesser from approximately USD 90 per tonne in March and the lowest possible from April 2021. Traders and market forecasters mentioned, that since the Chi",
    "scraped_date": "2025-11-16 18:51:49"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/indias-steel-products-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 90.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "g which in turn is driving up the price of the inexpensive ores and lessening the gap between high and low grades to less than USD 40 per tonne in the current month. This is lesser from approximately USD 90 per tonne in March and the lowest possible from April 2021. Traders and market forecasters mentioned, that since the Chinese steel manufacturers are looking for cheaper raw materials to deal wi",
    "scraped_date": "2025-11-16 18:51:49"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/indias-steel-products-prices",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 40.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "iron ore in their production process to bring down the costs and this is resulting in the rise of the price of the low-cost ores and minimizing the difference between high and low grades to less than USD 40 in November month.",
    "scraped_date": "2025-11-16 18:51:49"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/iron-ore-prices-have-been-decreasing",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 96.1,
    "price_range_min": null,
    "price_range_max": null,
    "context": "tinue to unsettle commodity markets. On the Dalian Commodity Exchange , the September iron ore contract slid by 5.8%. Futures traded on the Singapore Exchange followed a similar path, dipping 5.6% to $96.1 per ton. The decline comes despite solid short-term demand signals, with Chinese hot metal output reaching its highest level in over a year. However, these fundamentals have taken a backseat to",
    "scraped_date": "2025-11-16 18:51:57"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/iron-ore-prices-rises-in-the-asia-pacific",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "September 2022",
    "price_usd": 99.5,
    "price_range_min": null,
    "price_range_max": null,
    "context": "eel, continued increasing output to benefit from the peak construction session in September 2022 and October 2022. Prices for iron ore cargoes with a 63.5% iron content for delivery into Tianjin were USD 99.5 per tonne, staying above the 10-month low of USD 98 reached on September 21, 2022, as low steel inventories could increase demand for inputs by blast furnaces as stimulus measures aim to supp",
    "scraped_date": "2025-11-16 18:51:58"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/iron-ore-prices-rises-in-the-asia-pacific",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "September 2022",
    "price_usd": 98.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "eak construction session in September 2022 and October 2022. Prices for iron ore cargoes with a 63.5% iron content for delivery into Tianjin were USD 99.5 per tonne, staying above the 10-month low of USD 98 reached on September 21, 2022, as low steel inventories could increase demand for inputs by blast furnaces as stimulus measures aim to support construction and manufacturing activity in China.",
    "scraped_date": "2025-11-16 18:51:58"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/iron-ore-prices-rises-in-the-asia-pacific",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "September 2022",
    "price_usd": 97.05,
    "price_range_min": null,
    "price_range_max": null,
    "context": "last furnaces as stimulus measures aim to support construction and manufacturing activity in China. On the Singapore exchange, benchmark October iron ore increased by 1.5 percent to a session high of USD 97.05 per tonne, while the September 2022 contract increased by 0.2 percent to USD 98.60. The most active January iron ore contract on China’s Dalian Commodity exchange finished its daytime tradin",
    "scraped_date": "2025-11-16 18:51:58"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/iron-ore-prices-rises-in-the-asia-pacific",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 98.6,
    "price_range_min": null,
    "price_range_max": null,
    "context": "tivity in China. On the Singapore exchange, benchmark October iron ore increased by 1.5 percent to a session high of USD 97.05 per tonne, while the September 2022 contract increased by 0.2 percent to USD 98.60. The most active January iron ore contract on China’s Dalian Commodity exchange finished its daytime trading 1.1 percent higher at 718.50 yuan per tonne. Request Access For Regular Price Upd",
    "scraped_date": "2025-11-16 18:51:58"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/low-iron-ore-demand-in-china-resulted-in-price-fal-below-usd-100-tonne",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2021",
    "price_usd": 100.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "Low Iron Ore Demand in China Resulted in Price Fall Below USD 100/tonne Mar 16, 2022 For the first time since July 2020, iron ore prices have fallen below USD 100 a tonne, as China, the world's largest steelmaker, tightened steel output controls to reduce ca",
    "scraped_date": "2025-11-16 18:52:14"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/low-iron-ore-demand-in-china-resulted-in-price-fal-below-usd-100-tonne",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2021",
    "price_usd": 100.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "Low Iron Ore Demand in China Resulted in Price Fall Below USD 100/tonne Mar 16, 2022 For the first time since July 2020, iron ore prices have fallen below USD 100 a tonne, as China, the world's largest steelmaker, tightened steel output controls to reduce carbon emissions. The major steel-making component has been dragged down by signs of a downturn in",
    "scraped_date": "2025-11-16 18:52:14"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/low-iron-ore-demand-in-china-resulted-in-price-fal-below-usd-100-tonne",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2021",
    "price_usd": 230.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ce carbon emissions. The major steel-making component has been dragged down by signs of a downturn in China's housing industry. Iron ore prices have slumped by more than half since reaching a high of USD 230 per tonne in May. So far, in 2021, it has lost 34 percent of its value. Iron ore is one of the worst-performing essential commodities this year due to its price decline. This is in stark contr",
    "scraped_date": "2025-11-16 18:52:14"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/low-iron-ore-demand-in-china-resulted-in-price-fal-below-usd-100-tonne",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2060",
    "price_usd": 230.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "infrastructure stimulus to recover from the pandemic-induced depression, which increased demand for the metal and supply concerns in Brazil due to the coronavirus epidemic. Following a record high of USD 230 earlier this year, iron ore prices began to fall as China tightened its grip on the steel sector. Due to its high energy consumption and antiquated technology and equipment, it is one of the c",
    "scraped_date": "2025-11-16 18:52:14"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/low-iron-ore-demand-in-china-resulted-in-price-fal-below-usd-100-tonne",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 300.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "heck in the future. Issues also beset China's property sector at Evergrande Group, the country's second-largest property developer. It is the world's most indebted property developer, owing more than USD 300 billion in obligations and on the verge of missing an interest payment due this week. On September 17, China Evergrande's Hong Kong-listed shares plunged 10.24 percent, highlighting concerns a",
    "scraped_date": "2025-11-16 18:52:14"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/price-fluctuation-of-iron-ore",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 123.8,
    "price_range_min": null,
    "price_range_max": null,
    "context": "on ore forecasts for the initial half of 2023 in spite of the expectations that ex-China demand continues to be subdued. In the meantime, the Singapore Exchange benchmark for March iron ore traded at $123.8 a tonne, up by 0.87 percent as of 0700 GMT. The fundamentals (Iron ore) are cooperative at the moment since the daily hot metal output followed an uptick, according to an international brokerag",
    "scraped_date": "2025-11-16 18:52:23"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/price-fluctuation-of-iron-ore",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 127.98,
    "price_range_min": null,
    "price_range_max": null,
    "context": "the fifth time in a row, while the latter rebounded. The most-traded May iron ore futures agreement on the Dalian Commodity Exchange (DCE) completed daylight trading 0.78 percent lower at 888.5 yuan (USD 127.98) a tonne. Request Access For Regular Price Update of Iron Ore The regional market stayed cautious of the effect of restrictions on production in Tangshan, the most prominent steel productio",
    "scraped_date": "2025-11-16 18:52:23"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/price-fluctuation-of-iron-ore",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 123.8,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ices of iron ore forecasts for the initial half of 2023 in spite of the expectations that ex-China demand continues to be subdued. In the meantime, the Singapore Exchange benchmark for March iron ore traded at $123.8 a tonne, up by 0.87 percent as of 0700 GMT. The fundamentals (Iron ore) are cooperative at the moment since the daily hot metal output followed an uptick, according to an internationa",
    "scraped_date": "2025-11-16 18:52:23"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/steel-prices-again-declined",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "January 2022",
    "price_usd": 123.23,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ferrous futures declined as rising portside iron ore inventory and mounting steel stocks indicated a sluggish recovery in demand, despite recent data suggesting an improving economy. At 841.50 yuan (USD 123.23) per tonne, the most actively traded May iron ore on China's Dalian Commodity Exchange DCIOcv1 closed daytime trade 2.2% down. The benchmark March contract for the steelmaking ingredient on",
    "scraped_date": "2025-11-16 18:52:42"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/steel-prices-again-declined",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "January 2022",
    "price_usd": 120.35,
    "price_range_min": null,
    "price_range_max": null,
    "context": "y iron ore on China's Dalian Commodity Exchange DCIOcv1 closed daytime trade 2.2% down. The benchmark March contract for the steelmaking ingredient on the Singapore Exchange, SZZFH3, was down 3.5% at USD 120.35 per tonne as of 0702 GMT. Despite data revealing that new bank loans in China ramped up more than anticipated to a record 4.9 trillion yuan (717.21 billion) in January 2022. Request Access",
    "scraped_date": "2025-11-16 18:52:42"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/steel-prices-again-declined",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 123.23,
    "price_range_min": null,
    "price_range_max": null,
    "context": "e inventory and rising steel stocks indicated a sluggish recovery in demand. The most commonly traded May iron ore on China's Dalian Commodity Exchange DCIOcv1 closed trade 2.2% lower at 841.50 yuan (USD 123.23) per tonne. As of 0702 GMT, 52ZFH3, the benchmark March contract for the steelmaking component on the Singapore Exchange, was down 3.5% at USD 120.35 a tonne",
    "scraped_date": "2025-11-16 18:52:42"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/steel-prices-again-declined",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 120.35,
    "price_range_min": null,
    "price_range_max": null,
    "context": "e DCIOcv1 closed trade 2.2% lower at 841.50 yuan (USD 123.23) per tonne. As of 0702 GMT, 52ZFH3, the benchmark March contract for the steelmaking component on the Singapore Exchange, was down 3.5% at USD 120.35 a tonne",
    "scraped_date": "2025-11-16 18:52:42"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/the-rise-of-the-indian-steel-sector",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2025",
    "price_usd": 24.88,
    "price_range_min": null,
    "price_range_max": null,
    "context": "duction capacities too saw an upsurge over a period of time. For example, the production capacity of SAIL is anticipated to hike from 13 MTPA to 50 MTPA by 2025, with an estimated total investment of USD 24.88 billion. JSPL Production Increase The steel production capacity of JSPL is estimated to increase by 19% in the year 2020 to March 2021. The firm has been witnessing a steady rise in the dema",
    "scraped_date": "2025-11-16 18:52:53"
  },
  {
    "source_url": "https://www.procurementresource.com/news-and-articles/the-steel-industry-aims-at-maximizing-output-and-improve-raw-material-security",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2022",
    "price_usd": null,
    "price_range_min": 124.0,
    "price_range_max": 125.0,
    "context": "21, with completed steel production and consumption at 97.882 million tonnes and 93.057 million tonnes, respectively. Additionally, by the end of 2022, it is predicted that crude steel output will be between 124 and 125 million tonnes. The pandemic has impacted economies all across the world, and India is no exemption. He added that with the restoration of domestic demand growth, the Indian econom",
    "scraped_date": "2025-11-16 18:52:54"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/formaldehyde-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "Q4 2020",
    "price_usd": null,
    "price_range_min": 260.0,
    "price_range_max": 280.0,
    "context": "in the region. Formaldehyde Price Trend for the Year 2020 Asia Following a solid recovery from COVID-19, China's feedstock methanol market had a sharp comeback in Q4 2020. Methanol prices varied in a range of 260-280 USD/MT at the end of November 2020, owing to expectations of constrained methanol supply from Iran during Q4 2020 in China. Due to these shortages, formaldehyde prices increased drama",
    "scraped_date": "2025-11-16 19:07:13"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/formaldehyde-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 203.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "na. Domestic formaldehyde inventories in China increased due to decreasing downstream use and low offtake volumes. China's formaldehyde prices also fell to their lowest point in December, with a spot price of 203 USD/MT Ex-Shangdao, with a decline in exports to Malaysia and South Korea. Europe Formalehyde prices fell in Q4 compared to Q2 and Q3 as a result of ample supply and weakening demand in G",
    "scraped_date": "2025-11-16 19:07:13"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/grey-cast-iron-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 138.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ober - December) of 2023 Product Category Region Price Time Period Grey Cast Iron Chemicals USA USD 2600/MT Dec'2023 Grey Cast Iron Chemicals Europe USD 2500/MT Dec'2023 Grey Cast Iron Chemicals Asia USD 138/MT Dec'2023 Stay updated with the latest Grey Cast Iron prices , historical data, and tailored regional analysis Asia The Chinese grey cast iron prices got back on their feet gradually as the",
    "scraped_date": "2025-11-16 19:08:21"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/hydrogen-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": null,
    "price_usd": 150.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "exas VIEW MORE A Collaboration Formed Between Indian Oil, L&T, and ReNew to Expand India’s Green Hydrogen Sector VIEW MORE Report Says, that the Global Urge for Using Green Steel May Harm Australia’s USD 150 billion Iron Ore Exports, If Miners Do Not Adjust to the Change VIEW MORE Table Of Contents Our Clients Get in Touch With Us UNITED STATES Phone:+1 307 363 1045 INDIA Phone: +91 8850629517 UNI",
    "scraped_date": "2025-11-16 19:09:39"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/iron-ore-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "Q1 2025",
    "price_usd": 109.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "mains cautiously downward due to rising supply and slower global steel demand. Iron Ore Price Trend for Q1 of 2025 Product Category Region Price Time Period Iron Ore Energy, Metals and Minerals China USD 109/MT Q1 2025 Stay updated with the latest Iron Ore prices , historical data, and tailored regional analysis In Q1 2025, iron ore prices in China showed a largely fluctuating pattern, opening and",
    "scraped_date": "2025-11-16 19:10:07"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/iron-ore-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "Q1 2025",
    "price_usd": 109.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "he latest Iron Ore prices , historical data, and tailored regional analysis In Q1 2025, iron ore prices in China showed a largely fluctuating pattern, opening and closing the quarter at approximately USD 109/MT (Spot FD). In early January, market sentiment was cautiously optimistic, supported by low port inventories and steady steel production from local mills. Trading activity remained stable as",
    "scraped_date": "2025-11-16 19:10:07"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/iron-ore-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2020",
    "price_usd": 218.4,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ase in the price over the previous year was believed to have increased the profitability of mining China's iron ore deposits, which were normally low-grade. For June 30, the 62% Fe Iron Ore Index was trading at 218.40 USD/dmt CFR North China, up 4.30 USD/dmt on the day. The Department of Industry increased its estimate by 14% from a March prediction, owing to robust iron ore prices, which reached",
    "scraped_date": "2025-11-16 19:10:07"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/iron-ore-price-trends/pricerequest",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "Q1 2025",
    "price_usd": 109.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "Ore Request Form Iron Ore Price Trend, Chart, Historical Prices & Forecast In Q1 2025, iron ore prices in China showed a largely fluctuating pattern, opening and closing the quarter at approximately USD 109/MT. Read More Request Form Please enter the Captcha text* Assistance from Experts We aim to provide one-stop solution for all procurement and sourcing information by engaging newest form of te",
    "scraped_date": "2025-11-16 19:10:09"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/kerosene-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2020",
    "price_usd": 67.07,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ughout the course of the month, with the whole volume shared between end-users in Mexico, the Bahamas, Panama and Nicaragua. Import Parity Platts Jet fuel shipped to the Brazilian port of Santos cost USD 67.07 per barrel on Jan. 8, down from USD 93.83 in 2020. However, Santos' jet kerosene prices have gradually grown since reaching an all-time low of USD 32.47/b on April 28, 2020. Procurement Reso",
    "scraped_date": "2025-11-16 19:10:50"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/kerosene-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2020",
    "price_usd": 93.83,
    "price_range_min": null,
    "price_range_max": null,
    "context": "hole volume shared between end-users in Mexico, the Bahamas, Panama and Nicaragua. Import Parity Platts Jet fuel shipped to the Brazilian port of Santos cost USD 67.07 per barrel on Jan. 8, down from USD 93.83 in 2020. However, Santos' jet kerosene prices have gradually grown since reaching an all-time low of USD 32.47/b on April 28, 2020. Procurement Resource provides latest prices of Kerosene. E",
    "scraped_date": "2025-11-16 19:10:50"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/kerosene-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2020",
    "price_usd": 32.47,
    "price_range_min": null,
    "price_range_max": null,
    "context": "l shipped to the Brazilian port of Santos cost USD 67.07 per barrel on Jan. 8, down from USD 93.83 in 2020. However, Santos' jet kerosene prices have gradually grown since reaching an all-time low of USD 32.47/b on April 28, 2020. Procurement Resource provides latest prices of Kerosene. Each price database is tied to a user-friendly graphing tool dating back to 2014, which provides a range of func",
    "scraped_date": "2025-11-16 19:10:50"
  },
  {
    "source_url": "https://www.procurementresource.com/resource-center/propylene-price-trends",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2020",
    "price_usd": 48.33,
    "price_range_min": null,
    "price_range_max": null,
    "context": "s were evaluated at 683 USD/MT. Latin America Brazil, according to the United Nations' COMTRADE database on international trade, exported propylene and other olefins, prim forms to Peru which totaled USD 48.33 million in 2020. Argentina exported polymers derived from propylene or other olefins in their primary forms to China for a value of USD 18.37 thousand in 2020. Procurement Resource provides",
    "scraped_date": "2025-11-16 19:19:02"
  },
  {
    "source_url": "https://www.procurementresource.com/websearch/iron%20ore",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2021",
    "price_usd": 150.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "a Purchased the Majority of Its Iron Ore from Australia and Brazil, While Imports from India Increased by About 90 Percent Report Says, that the Global Urge for Using Green Steel May Harm Australia’s USD 150 billion Iron Ore Exports, If Miners Do Not Adjust to the Change Elevated Iron Ore Prices Led to Rio Tinto’s Record Profit and a USD 16.8 Billion Dividend says Company’s Annual Report Low Iron",
    "scraped_date": "2025-11-16 19:26:25"
  },
  {
    "source_url": "https://www.procurementresource.com/websearch/iron%20ore",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2021",
    "price_usd": 100.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "t Adjust to the Change Elevated Iron Ore Prices Led to Rio Tinto’s Record Profit and a USD 16.8 Billion Dividend says Company’s Annual Report Low Iron Ore Demand in China Resulted in Price Fall Below USD 100/tonne Iron Ore May Witness Fundamental Transformation Owing to Shortage of New Supply and Decarbonisation China's Deteriorating Industrial Prospects are Yet to Reflect on the Copper and Iron O",
    "scraped_date": "2025-11-16 19:26:25"
  },
  {
    "source_url": "https://www.procurementresource.com/websearch/iron%20ore",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2024",
    "price_usd": 50.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "eading to Rising Iron Ore Prices Benchmark Iron Ore Prices Rises in the Asia Pacific as Demand for Steel Products in China is Likely to Rebound HRC Steel Prices in the United States were Increased by USD 50-70 per tonne Due to Increased Demand and Low Iron Ore Prices Hot Rolled Steel Prices Will Rise Further Due To An Increase In Coking Coal & Iron Ore Prices A Mixed Near-Term Outlook Resulted In",
    "scraped_date": "2025-11-16 19:26:25"
  },
  {
    "source_url": "https://www.procurementresource.com/websearch/steel",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "2022",
    "price_usd": 150.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ugments to Address Global Shortages The Steel Industry Aims at Maximizing Output and Improve Raw Material Security in 2022 Report Says, that the Global Urge for Using Green Steel May Harm Australia’s USD 150 billion Iron Ore Exports, If Miners Do Not Adjust to the Change India’s Domestic Steel Demand and Output are Unlikely to be Impacted in the Forecast Year 2022 Merfish United Fully Acquired by",
    "scraped_date": "2025-11-16 19:26:40"
  },
  {
    "source_url": "https://www.procurementresource.com/websearch/steel",
    "source_name": "www.procurementresource.com",
    "forecast_date": null,
    "outlook_date": "January 2023",
    "price_usd": 50.0,
    "price_range_min": null,
    "price_range_max": null,
    "context": "ue to Sluggish Demand and Oversupply India’s Steel Products Prices Continue to fall Due to Sluggish Demand in Domestic and International Market HRC Steel Prices in the United States were Increased by USD 50-70 per tonne Due to Increased Demand and Low Iron Ore Prices Hot Rolled Steel Prices May Rise By 4-6 Percent In January 2023 Hot Rolled Steel Prices Will Rise Further Due To An Increase In Coki",
    "scraped_date": "2025-11-16 19:26:40"
  }
]