[
  {
    "title": "Syndax Pharmaceuticals a promising commercial biotech with multiple approved drugs - Price target $20-56 (M&amp;A possible)",
    "selftext": "Hello,\n\nI'll get to the chase and I'll try to keep it short. No AI usage (Only for formatting so it's easier to read), however do your own DD. My position is 311 contracts of 2026 OTM calls and planning to add more.\n\nhttps://i.imgur.com/U3hXCUd.png\n\n---\n\n**TLDR:**\n\n- Small-cap oncology / hematology biotech that now has two commercial products: **Revuforj® (revumenib)**, a menin inhibitor for select AML patients, and **Niktimvo™ (axatilimab-csfr)** (co-developed with Incyte) for chronic GVHD.  \n- Has over **$456 million** cash in hand. Syndax expects that its operating expense base will remain stable over the next few years. As a result, Syndax expects that its cash, cash equivalents and short- and long-term investments, combined with its anticipated product revenue and interest income, will enable the company to reach profitability. Meaning **no dilution** for investors.  \n- Received **U.S. FDA approval for Revuforj on October 24, 2025**, for the treatment of R/R acute myeloid leukemia (AML) with a susceptible NPM1 mutation in adult and pediatric patients one year and older who have no satisfactory alternative treatment options. Revuforj is now the **first and only FDA-approved therapy** for both R/R AML with an NPM1 mutation and R/R acute leukemia with a KMT2A translocation.  \n- Has Analyst price targets ranging from $18 to $56. With almost all recommending at least a \"Buy\"\n\n---\n\nIf you go and look at their revenue multiple so far — it continues to trade at a fraction of the valuation of peer commercial-stage oncology &amp; non-oncology focused bios with similar projected revenue profiles.  \nSNDX's year-to-date gross margin is **~96%**, which is ultra-competitive.  \nRevuforj is a **pill**. Niktimvo is administered via **IV**.\n\nhttps://i.imgur.com/vOwjoez.png\n\n---\n\n**M&amp;A?**\n\n- Incyte CEO was on the board of Syndax for years before he got a job as the CEO of Incyte.  \n- Incyte faces a patent cliff issue in 2028.  \n- It already shares revenue with Syndax and Syndax drugs work great in synergy with Incyte.  \n- Incyte has over **$2.9B cash in hand.**\n\nAccording to this analysis below:  \nhttps://i.imgur.com/dwgqvFz.png\n\nWe can estimate an **M&amp;A value range**:  \n- **Lowest:** $20.48  \n- **Median:** $38.80  \n- **Highest:** $68.51  \n\nNote that Incyte’s recent earnings call hinted at M&amp;A activity:\n\n**Incyte earnings tidbits**\n\n- **Niktimvo** continues to surpass expectations across all launch metrics  \n- 90% of US bone marrow centers have adopted, with all call centers placing repeat orders year to date  \n- 80% of patients who started treatment in first quarter of launch are still on treatment today  \n- Captured 13% of 3rd line+ GVHD opportunity in just the first nine months on the market  \n- Primarily being used in 4th line, with increasing preference and utilization in 3rd line  \n- Real-world safety &amp; efficacy equally as impressive as the clinical data  \n- Actively studying Niktimvo in earlier lines of therapy to create a steroid-free regimen to shift standard of care (**Jakafi combination**, has the potential to deliver benchmark efficacy and steroid tapering)  \n- **“Franchise” strategy to increase addressable market share and strengthen leadership position in GVHD**  \n\n---\n\n**Risks**\n\n- **KURA's drug approval** is on November 30th. It competes with the recently approved SNDX drug patient subset.  \n- While it’s marginally safer, it has lower efficacy.  \n- If it gets the same label or a CRL, this risk would be eliminated.  \n\n---\n\n**Upcoming Catalysts**\n\n- **Nov 10–20:** Upcoming investor events — watch for M&amp;A hints or if they're offering more detail on the data for ASH.  \n- **Nov 30:** KURA's drug decision — if it gets a label or CRL then SNDX will benefit.  \n- **Dec 6–8 (ASH Conference):** Major new phase data and abstracts. First look into the data for the Rev + ven + aza combo, which is critical.  \n- **Q1 2026:** Colon cancer phase 1 results — if successful, it could add $1B+ to SNDX TAM/value.  \n  - If SNDX is bought before approval (likely), it’d add $300–500M due to the inherent FDA approval risk.  \n\n---\n\n**Recent Business Highlights (from Q3 2025 Earnings Release)**  \nSource: https://ir.syndax.com/news-releases/news-release-details/syndax-reports-third-quarter-2025-financial-results-and-provides\n\n---\n\n### Revuforj® (revumenib)\n\n- Achieved **$32.0M in Revuforj net revenue** in Q3 2025, a **12% increase** over Q2 2025.  \n- Total prescriptions in Q3 were ~850, a **25% increase** over Q2 2025.  \n- Received U.S. FDA approval (Oct 24, 2025) for R/R AML with NPM1 mutation — first and only FDA-approved therapy for both R/R AML with NPM1m and R/R acute leukemia with KMT2A translocation.  \n- Added to **NCCN Guidelines®** for AML as a **category 2A** recommended treatment option (Sept 18, 2025).  \n- 12 Revuforj abstracts, including 3 oral presentations, will be highlighted at **ASH 2025**.  \n\n**Ongoing and upcoming trials:**\n\n- **EVOLVE-2 (Phase 3):** Revuforj + venetoclax + azacitidine (newly diagnosed NPM1m AML, unfit for intensive chemo).  \n- **SAVE (Phase 1/2):** Revuforj + venetoclax + decitabine/cedazuridine (NPM1m, KMT2Ar, NUP98r). Data from first cohort at ASH 2025.  \n- **Intensive chemo combos (Phase 1):** Revuforj + 7+3 → maintenance; preliminary data at ASH 2025.  \n- **BEAT AML:** Revuforj + venetoclax + azacitidine in older adults (≥60).  \n- **Break Through Cancer (Phase 2):** Revuforj + venetoclax for MRD elimination and extended PFS.  \n- **INTERCEPT (Phase 1):** Revuforj for MRD and early relapse in AML.  \n- **REVEAL trials (start-up):** Revuforj + SOC in newly diagnosed AML (NPM1m or KMT2A-r). Starting by end of 2025.  \n- Evaluating Revuforj in **metastatic MSS colorectal cancer** — data expected **Q1 2026**.  \n\n---\n\n### Niktimvo™ (axatilimab-csfr)\n\n- Achieved **$45.8M in Niktimvo net revenue** in Q3 2025, up **27%** over Q2 2025.  \n- Syndax and Incyte are co-commercializing Niktimvo (50/50 profit split).  \n- Syndax’s share of Niktimvo contribution in Q3 was **$13.9M** (reported as collaboration revenue).  \n- 11 Niktimvo abstracts (3 oral) to be showcased at **ASH 2025** — long-term benefit and tolerability data.  \n\n**Ongoing trials:**\n\n- **Phase 2 (open-label):** Niktimvo + ruxolitinib (newly diagnosed cGVHD, ≥12 years).  \n- **Phase 3 (pivotal):** Niktimvo + corticosteroids (newly diagnosed cGVHD, ≥12 years).  \n- **MAXPIRe (Phase 2):** Niktimvo in idiopathic pulmonary fibrosis (IPF); enrollment to complete by end of 2025, topline data 2H 2026.  \n\n---",
    "subreddit": "wallstreetbets",
    "author": "potrait762",
    "score": 57,
    "num_comments": 39,
    "created_utc": 1762702120.0,
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1osm5n8/syndax_pharmaceuticals_a_promising_commercial/",
    "is_self": true,
    "has_forecast_keywords": true
  },
  {
    "title": "Abaxx Technologies: Newest Clearing House and Exchange with Massive Upside",
    "selftext": "This is gonna be a longish post. Potential for more than a 50x maybe even +100x but that's extremely hopeful. It has digital identity, digital assets, T+0 settlement, digital gold, tokenized stocks, exchange and clearinghouse.\n\nThe stock just hit 1 billion USD market cap so I can finally post about it here.\n\n**TLDR:** 10x in 1-2 years, 50x within 5 years.\n\nNew high tech globally recognized and licensed clearinghouse/exchange that is integrating their new digital identity with digital title ownership that has legal finality. Basically merging better tech than CRCL ($30 billion MC) with better tech than CME ($95 billion MC) to unlock a 42 trillion dollar industry.\n\nFirst you have to understand, that commodity clearinghouses and exchanges are worth ALOT of money. Here is all the publicly listed ones. Very few exist. Notice Abaxx at the bottom worth 1 billion.  \n\n\n|Clearing|Parent Company|Stock Ticker|Market Capitalization (Nov 2025)|\n|:-|:-|:-|:-|\n|CME Clearing|CME Group Inc.|CME (NASDAQ)|\\~$93 billion|\n|LCH.Clearnet|London Stock Exchange Group plc (LSEG)|LSEG.L|\\~$49 billion|\n|ICE Clear (U.S., Europe, etc.)|Intercontinental Exchange, Inc. (ICE)|ICE|\\~$83 billion|\n|Hong Kong Securities Clearing|Hong Kong Exchanges and Clearing Ltd (HKEX)|[0388.HK](http://0388.HK)|\\~$69 billion|\n|Clearstream|Deutsche Börse AG|[DB1.DE](http://DB1.DE)|\\~$47 billion|\n|Abaxx Clearing|Abaxx Technologies Inc.|ABXX (NEO) / ABXXF (OTCQX)|\\~$1 billion|\n\n\n\nThe problem lately is that the big ones have been ignoring industry requests for physically delivered contracts. Now they just launch financially settled contracts which are mostly products for traders not commodity companies which need physical delivery.\n\nAlso you have LBMA that trades metals like nickel. Remember when LBMA reversed nickel trades for a their Chinese trader because he was caught with his pants down?\n\nSo industry is ready for another exchange and a clearinghouse that will fix these issues. Many have come to Abaxx for this.\n\nNow in comes Abaxx exchange and clearinghouse. Their focus has been physically delivered that are being requested by industry. They have launched LNG, Carbon, Nickel, Lithium, and Gold. LNG and Gold could easily be worth billions each. The others worth hundreds of millions. This is just what they launched so far. They plan to launch much more like weather derivatives likely to come this year still.\n\nAbaxx LNG physically delivered contract is already set to replace the financially settled JKM LNG contract (which generates over 100+ million in revenue) as it is better in all aspects due to physically delivered nature.\n\nI[n June JKM reported 128,000 lots traded. In November, Abaxx had 9,529 lots traded across its LNG contracts. So already 7.4% of the trading.](https://x.com/James_Duade/status/1984588708444598605) Not a equal comparison month comparison, but just a rough idea. All without US trading firms while Abaxx gets approval to support US clients (CFTC Approval expected after lockdown is over). They are regulated out of Singapore which the US already sees as equivalent, they just need the final sign off. As Abaxx volumes grows, traders will need to trade their LNG out of necessity. As it continues to grow, risk management will require Abaxx LNG physically delivered contracts, again out of necessity.\n\nI suspect Abaxx will overtake JKM in 2026 and make it essentially worthless. Abaxx's LNG contracts alone will likely be worth 5-10 billion USD creating a pretty good safety buffer at a 5x from here.\n\nAbaxx is also piloting tech with Minehub to let traders us LNG shipments on water as collateral in their futures exchange. This will be expanded out to all their futures markets on success and will also allow traders to use their gold as collateral with much better rates.\n\nTheir gold futures contract is also gaining traction. They are likely to launch gold spot this month as well with a similar system set up for silver next month. Maybe even this month as well.\n\nFor those unaware of the gold markets, New York is the futures market and London is the spot market. Which means traders have to physically ship gold bars in a plane to meet delivery. And the gold bars are different sizes (so need a smelter) and in different legal jurisdictions.\n\nAbaxx Gold market (and soon silver) will have futures and spot take delivery in the same location, same legal jurisdiction and same gold bar sizes which are also smaller and easier to trade. There is significant efficiencies here which will likely act as a liquidity blackhole for all precious metals markets.\n\n**Digital Cheques**\n\nAbaxx has announced the pilot launch of their own digital cheques for money market funds that transfer instantly. (I want to avoid that cursed word stable coin because Abaxx has nothing to do with that industry). But Abaxx's tech is better. It’s completely private with legal finality. For those bullish on Circle/Tokenization, just know that banks and companies are never gonna adopt stablecoins on a public ledger that can be all tracked by your favourite three letter agency or competitors. Don't get be even started on counterparty risk of those products. It is a product for retail only.\n\nAbaxx exchange and clearing house was built from the ground up with this technology integrated into the exchange. Which means they will use it for instant money transfers and instant T+0 settlement. I can’t emphasize enough what T+0 settlement means for liquidity and trading. It also unlocks the ability for LNG traders to collateralize their trades with gold for example. Nothing more annoying than wanting to trade something but you have to wait several business days for funds to clear or pay interest to get immediate access.\n\nThe same technology they are also planning to bring to stocks allowing for instant settlement and trading. And if you are paying attention, it’s connected to a regulated clearinghouse and exchange. One of the most regulated customers they will ever have. When they eventually launch a currency trading platform, you can have instant international wire transfers that are routed through a currency exchange to get the current exchange rate and have it instantly settle. None of these $50 wire transfers with awful exchange rates that takes 3 days to arrive in your account.\n\nI would dare to say they are building the entire ecosystem needed to bypass the swift network. Think of it like an Apple ecosystem. You use swift to get into it by wiring money to their custodians ([which Abaxx also launched and is using it for their carbon markets](https://x.com/JoshCrumb/status/1964042716083364164) ), but once inside, you have access to instant money transfers, clearinghouse and exchange, stock markets, commodities, and forex. So Abaxx is building the Apple equivalent for the global financial system.\n\nAbaxx will also be focusing on bringing 42 Trillion worth of MMFs and Gold to the digital world next year while taking 5 basis points ($21 billion revenue potential) to do so yearly as well as some transaction fees. Obviously they won't get everything. But several of their partners and investors manage already trillions of MMF and appear to like the product. [Their investors control +50% of the MMF funds in USA.](https://x.com/JosephTMetcalf/status/1973059584915898697)\n\n**Digital Identity**\n\nOkay so behind all their is their ID++ which is their digital identity. It’s all private and encrypted and you use it with the exchange. The Exchange will perform KYC on you and issue credentials. These credentials you use to sign your trades and money transfers. It’s built in a way that you can grant access to portions of it as needed. If you need to sign up for a platform thats needs to KYC you, you grant access to only a certain portion your digital identity on a limited basis. Then you can revoke their access and no longer have access to your documents so you don’t have to be exposed to data hacks on every platform you sign up on. It is built with all the latest digital identity standards like w3 but it's also self sovereign which means you control your identity and its not issued by a government entity. The end goal being is that governments would issue credentials independently to your id and create a \"chain\" of verified credentials. Universities as well for example would issue your grad certificates so you can verify it instantly if someone ever required. But you retain full control of it.\n\nThe point here isn't so much what it does though, but what it unlocks. Abaxx uses this for their clearing activities and is one of their secret sauces that helps them instantly clear their transactions.\n\n**Graded Commodities**\n\nGoing back to the exchange, Abaxx will also be launching graded commodities. For example different levels of copper grading based on metadata which allows you track carbon emissions or anything else needed. Currently nothing like it exists and will be done through their Minehub partnership.\n\nIt would prevent electric car companies saying their technology is clean while importing cobalt that was mined from forced labour in Africa. With Abaxx you could get premiums on commodities that were mined cleanly and ethically.\n\nRegulations for carbon emissions are also starting to pick up pace. Countries are introducing legislation requiring scope 3 emissions reporting (aka higher up the supply chain). Australia, Brazil, California, Canada, Hong Kong, New Zealand, Singapore, Europe, and USA are all introducing legislation that require commodity supply chain tracking for source of origin, forced labour monitoring, or carbon emissions.\n\nThis information is not available on current exchanges making them a black box. Abaxx will launch graded versions of these commodities that include metadata that tracks the commodity through its entire supply chain.\n\nI could go on but I'll stop it here. I am already at \\~4x since i have been buying this stock for a while and just averaging in the entire time. I think it could be $100 billion+ company but the reasoning why would require a second more in depth DD. I can do it if there is enough interest. But based what I said already i think $50 billion is a good limit. If I am right, I see no reason to ever sell this company so I will be holding indefinitely. You can only buy stock on CBOE in Canada, OTC in USA (Sorry robinhood users, get literally any other broker), and on Frankfurt exchange as well.\n\n[Cantor just put a price target of $81 CAD on it](https://www.investing.com/news/analyst-ratings/cantor-fitzgerald-initiates-abaxx-technologies-stock-with-overweight-rating-93CH-4318669). So industry backed 2x if you have less risk tolerance and don't quite yet see the vision. That price target only accounts for exchange angle and doesn't account for their tech which is significantly higher. This stock is forward looking and revenues are just now starting to pick up. Hence the recent surge in stock price.\n\n[Here is a in depth video highlighting how it could be worth hundreds of billions. Video is 1hr and 20 min long. ](https://youtu.be/go0bc0K4UdQ?si=LrN3VQdKGw0wwdfW) He runs a family office and he works with the team as sort of a liaison trying to connect sellers with institutions wanting to buy in size so obviously a bit of bias. At the same time though, after having done lots of research myself, you will start to realize that the exchange and clearinghouse (worth tens of billions on its own) is actually just one portion of what they are trying to build. Hence my example of the Apple like ecosystem.\n\nWill answer any questions as best I can.\n\n**Positions**\n\nMy current position: 9690 shares.\n\nhttps://preview.redd.it/nryvwb5hbuyf1.png?width=1034&amp;format=png&amp;auto=webp&amp;s=89f189e838ddaa1c1f1a178e4e08f896514b8aa3\n\nhttps://preview.redd.it/v5mdto2ibuyf1.png?width=1269&amp;format=png&amp;auto=webp&amp;s=ac821e48885005bb91732c18abff9283bbac5295",
    "subreddit": "wallstreetbets",
    "author": "theSherlockView",
    "score": 124,
    "num_comments": 112,
    "created_utc": 1762101720.0,
    "url": "https://www.reddit.com/r/wallstreetbets/comments/1omm40e/abaxx_technologies_newest_clearing_house_and/",
    "is_self": true,
    "has_forecast_keywords": true
  }
]